<a href="https://colab.research.google.com/github/LZY199/PracticalAI/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [6]:
import numpy as np
import pandas as pd
#Set seed for reproductibility
np.random.seed(seed=1234)

In [9]:
# Read from CSV to Pandas DataFrame
#The header=0 signifies that the first row (0th index) is a header row which contains the names of each column in our dataset.

url = "https://raw.githubusercontent.com/GokuMohandas/madewithml/main/datasets/titanic.csv"
df = pd.read_csv(url, header=0)

In [10]:
# First few items
df.head(3)

   pclass                            name     sex  ...    cabin  embarked  survived
0       1   Allen, Miss. Elisabeth Walton  female  ...       B5         S         1
1       1  Allison, Master. Hudson Trevor    male  ...  C22 C26         S         1
2       1    Allison, Miss. Helen Loraine  female  ...  C22 C26         S         0

[3 rows x 11 columns]

* class: class of travel 

* name: full name of the passenger 
* sex: gender * age: numerical age 
* sibsp: # of siblings/spouse aboard 
* parch: number of parents/child aboard 
* ticket: ticket number 
* fare: cost of the ticket
* cabin: location of room 
* emarked: port that the passenger embarked at (C - Cherbourg, S - Southampton, Q - Queenstown) 
* survived: survial metric (0 - died, 1 - survived)

In [11]:
import matplotlib.pyplot as plt
# Describe features to extract some standard details about our numerical features.
df.describe()

            pclass          age  ...         fare     survived
count  1309.000000  1046.000000  ...  1308.000000  1309.000000
mean      2.294882    29.881135  ...    33.295479     0.381971
std       0.837836    14.413500  ...    51.758668     0.486055
min       1.000000     0.166700  ...     0.000000     0.000000
25%       2.000000    21.000000  ...     7.895800     0.000000
50%       3.000000    28.000000  ...    14.454200     0.000000
75%       3.000000    39.000000  ...    31.275000     1.000000
max       3.000000    80.000000  ...   512.329200     1.000000

[8 rows x 6 columns]

In [14]:
# Correlation matrix
df.corr()
#plt.matshow(df.corr())

            pclass       age     sibsp     parch      fare  survived
pclass    1.000000 -0.408106  0.060832  0.018322 -0.558629 -0.312469
age      -0.408106  1.000000 -0.243699 -0.150917  0.178739 -0.055513
sibsp     0.060832 -0.243699  1.000000  0.373587  0.160238 -0.027825
parch     0.018322 -0.150917  0.373587  1.000000  0.221539  0.082660
fare     -0.558629  0.178739  0.160238  0.221539  1.000000  0.244265
survived -0.312469 -0.055513 -0.027825  0.082660  0.244265  1.000000